In [27]:
import pandas as pd
import numpy as np

In [30]:
tn = pd.read_csv("titanic.csv")
tn.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
bypclass = tn.groupby("Pclass").agg({"Survived":"sum","Name":"count"})

In [44]:
bypclass["Survival"] = bypclass["Survived"]/bypclass["Name"]
bypclass

        Survived  Name     Ratio  Survival
Pclass
1            136   216  0.629630  0.629630
2             87   184  0.472826  0.472826
3            119   491  0.242363  0.242363

In [45]:
bypclass["Ratio"]

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Ratio, dtype: float64